#+TITLE:     Repr Encoding
#+AUTHOR:    mattiasdrp
#+EMAIL:     mattias@tarides.com
#+DESCRIPTION: This document documents the Repr encoding and the solutions to make it zero(or one)-copy
#+KEYWORDS:  repr, ocaml

#+begin_src ocaml :results none :exports never
  #use "topfind" ;;
  #require "repr";;
#+end_src

** Example

#+begin_src ocaml :results value verbatim :exports both :eval no-export
  let buf = Buffer.create 2;;

  let () =
       Repr.((unstage @@ encode_bin int) 2 (Buffer.add_string buf));
       Repr.((unstage @@ encode_bin int) 3 (Buffer.add_string buf));
       Repr.((unstage @@ encode_bin int) 4 (Buffer.add_string buf));
       Format.eprintf "%S@." (Buffer.contents buf)
#+end_src

#+RESULTS:
: "\002\003\004"

We created a new buffer ~buf~ and provided ~encode_bin~ the function to write in this buffer the encoding that it generated.

Now, if we want to decode from this buffer:

#+begin_src ocaml :results value verbatim :exports both :eval no-export
  let () =
    let buf_str = Buffer.contents buf in
    let off, a = Repr.((unstage @@ decode_bin int) buf_str 0) in
    let off, b = Repr.((unstage @@ decode_bin int) buf_str off) in
    let _, c = Repr.((unstage @@ decode_bin int) buf_str off) in
    Format.eprintf "%d %d %d@." a b c
#+end_src

#+RESULTS:
: 2 3 4

The decoder knows exactly the number of bytes it needs to read, will decode this number of bytes from the provided string and return the new offset where the remaining data should be.

** Problem

Now, as you can see, there's a flaw. ~encode_bin~ takes a function of type ~string -> unit~. This means that it needs to create this string to provide it to the function. Summarised, this would look like this:

- Caller wants to encode a value ~v~
- Caller has a buffer in which the encoding of ~v~ will be written
- Caller provides ~encode_bin~ with a function to write in this buffer
- ~encode_bin~ encodes ~v~ as a string
- ~encode_bin~ applies the function it was provided to the string
- the string is now useless and can be garbage collected

As you can see in these implementations:

#+begin_src ocaml :exports code :eval non-export
  let int64 i =
    let b = Bytes.create 8 in
    Bytes.set_int64_be b 0 i;
    unsafe_add_bytes b

  let float f = int64 (Int64.bits_of_float f)
#+end_src

#+RESULTS:
: Line 4, characters 2-18:
: 4 |   unsafe_add_bytes b
:       ^^^^^^^^^^^^^^^^
: Error: Unbound value unsafe_add_bytes

These functions allocate a new byte and end with creating a partial execution waiting for the ~string -> unit~ function

This way of doing looks like it's doing useless allocations but how can we get rid of them?

